[
  {
    "name": "Fabiola Agustina Kansil",
    "email": "fabiola@nus.edu.sg",
    "title": "Senior Principal Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/FABIOLA.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Fabiola is a highly experienced counselling professional whose career reflects a deep commitment to supporting individuals and communities across a range of complex issues. With years of work and practice in International School and Family Service Centre, she developed a strong foundation in community-based work, addressing diverse psychosocial and mental health concerns for people from all walks of life.",
      "Since joining NUS in January 2013, Fabiola has played a pivotal role in shaping the development of student mental health services. She holds a Graduate Certificate in Clinical Supervision and recently completed a Group Supervision course, further strengthening her clinical expertise. Fabiola is also trained in EMDR Level 3 and Satir Model Level 2, besides other modalities, enabling her to work effectively with students facing a variety of therapeutic needs.",
      "Fabiola has provided consultations since 2016, offering valuable clinical insights and guidance to her peers. Since 2022, she has expanded her impact as a clinical supervisor, fostering the growth and reflective practice of counsellors in the field. As a registered member of the Singapore Association for Counselling, she is committed to upholding the highest levels of ethical and professional practice and is actively working towards certification as an SAC Supervisor.",
      "As Head overseeing NUS student mental health services, Fabiola has a comprehensive view of the evolving needs of the student population. She works closely with a wide array of stakeholders—including students, faculty, and external partners—to ensure that mental health support is accessible, evidence-based, and responsive."
    ]
  },
  {
    "name": "Hema D/O Sivanathan",
    "email": "hema.siv@nus.edu.sg",
    "title": "Senior Principal Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/hema.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Hema is a Lead Counsellor with over a decade of dedicated service across diverse settings, including forensic environments and educational institutions. Her broad clinical expertise encompasses supporting individuals navigating a wide spectrum of psychological challenges, such as stress, depression, anxiety, adjustment difficulties, attachment concerns, complex trauma, and interpersonal struggles.",
      "As a member of HWB’s student-facing team at University Counselling Services (UCS), Hema delivers individual counselling while championing the cause of student mental health and well-being in NUS. She draws upon a robust foundation in evidence-based modalities—including Cognitive Behavioural Therapy (CBT), mindfulness-based interventions, and Eye Movement Desensitisation and Reprocessing (EMDR).",
      "A registered member of the Singapore Association for Counselling (SAC), Hema is actively advancing her professional journey towards SAC Supervisor membership and full EMDR certification. Since 2016, she has provided informal consultations to colleagues and, from 2022, has formally supervised clinicians, reflecting her deep commitment to nurturing the next generation of counsellors. Her advanced training includes a Graduate Certificate in Clinical Supervision, EMDR Level 3, and Brainspotting Level 1.",
      "Hema’s supervisory approach is eclectic and integrative, weaving together multiple therapeutic frameworks and reflective practices. She is dedicated to fostering her supervisees’ clinical competence, encouraging self-reflection, and supporting their ongoing professional development, thus contributing meaningfully to the growth of the counselling profession."
    ]
  },
  {
    "name": "Durajpandi Angeline Jayanthi",
    "email": "angie.mj@nus.edu.sg",
    "title": "Senior Principal Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/ANGELINE.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Dr. Angeline Jayanthi (Doctor of Professional Studies in Counselling and Psychotherapy) is an experienced and dedicated counselling professional, bringing more than a decade of clinical practice across a range of settings and client populations. She holds a doctorate, reflecting her commitment to both clinical excellence and lifelong learning.",
      "As a core member of HWB’s student-facing team at University Counselling Services (UCS), Angeline currently serves as Lead Counsellor providing guidance and support to university students navigating a broad spectrum of academic, emotional, and personal challenges. Angeline is a Master Clinical Member and a Registered Clinical Supervisor with the Singapore Association for Counselling (SAC), reflecting her advanced expertise and steadfast commitment to excellence in both clinical practice and supervision. Her therapeutic work is grounded in empathy, cultural sensitivity, and an integrative approach that encompasses CBT, Schema Therapy, Internal Family Systems, and trauma-focused modalities, all tailored to each client’s unique needs.",
      "As a counselling supervisor, Dr. Angeline adopts a reflective, developmental, and integrative supervision approach. She prioritizes building a collaborative and trusting relationship with supervisees, fostering an environment where open dialogue, professional growth, and self-reflection are encouraged. Angeline tailors her supervision to each clinician’s stage of professional development, providing structured guidance to those early in their careers and facilitating greater autonomy for experienced practitioners.",
      "Her supervision sessions emphasize ethical practice, cultural competence, and the integration of evidence-based interventions. Angeline is committed to providing constructive feedback, supporting skill development, and nurturing clinicians’ confidence and professional identity. She believes in empowering clinicians to engage deeply with their work, reflect critically on their practice, and uphold the highest standards of client care."
    ]
  },
  {
    "name": "Evangeline Chen",
    "email": "e_chen@nus.edu.sg",
    "title": "Senior Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/EVANGELINE.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Evangeline is a senior counsellor at UCS and Clinical Member of Singapore Association for Counselling (SAC). She currently supports students with a wide range of presenting concerns, including trauma, anxiety, depression, grief and relational issues. Her integrative therapeutic approach draws from Attachment-Focused Eye Movement Desensitisation and Reprocessing (AF-EMDR), Cognitive Behavioural Therapy (CBT) and Acceptance and Commitment Therapy (ACT), tailored to each student’s needs.",
      "Evangeline has been supporting colleagues through case consultations and clinical supervision since 2022 and 2024, respectively. She completed her Certificate in Clinical Supervision with Counselling and Care Centre (CCC) in 2024. Her supervision approach focuses on creating a safe and supportive environment, so as to grow in clinical competence and ability to reflect on their practice."
    ]
  },
  {
    "name": "Tan Rui Ping, Benjamin",
    "email": "benjamin.tan@nus.edu.sg",
    "title": "Senior Counselling Psychologist",
    "specialisation": "Counselling Psychologist",
    "photoUrl": "/images/Benjamin.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Ben is a Counselling Psychologist by training, who completed his masters in the United States in 2013 and has been with NUS since 2017. He is a Registered Counsellor with the Singapore Association for Counselling so he is able to provide supervision for colleagues with SAC, but not SPS hours requirements.",
      "Ben’s main theoretical orientation is Psychodynamic-Intersubjectivity, to which he has incorporated interventive skillsets from Motivational Interviewing, Schema Therapy, EMDR, Collaborative & Proactive Solutions, and the Gottman Couples method. His past clinical work experiences have included substance abuse / addiction work in tertiary education and hospital settings, systemic and behavioural work in a special needs school, as well as broad spectrum psychotherapy work with the Employee Assistance Program for a US state government. Ben is also comfortable working at the intersection of psychotherapy and spirituality, having also completed graduate studies in Pastoral Ministry concurrent with his psychology training.",
      "In terms of supervisory style, he prefers an affirming, collaborative, and strengths-based approach that starts with clear setting of joint hopes and goals, with ample space for adaptation and accommodating of changes, as needed, along the way. In previous supervision cycles he has supported colleagues with counselling and social work backgrounds, in addition to providing day-to-day case management, risk, clinical consultations for all types of clinicians within UCS. Ben’s clinical supervision training was grounded in multi-modal and systemic thinking, reflexive practice, as well as affirming the Person of the Therapist.",
      "As mentioned at the beginning of this blurb, Ben would be more suitable for supervisees needing SAC supervision hours, but is open to support any colleagues interested to converse on matters sundry, be they clinical, psychological, vegetable, animal, or mineral."
    ]
  },
  {
    "name": "Chan Ka Po Carol",
    "email": "carolc@nus.edu.sg",
    "title": "Senior Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/CAROL.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Carol is a Senior Counsellor with the University Counselling Services (UCS), bringing over nine years of clinical experience supporting students. She holds a Master of Counselling and is a Registered Counsellor and Clinical Member of the Singapore Association for Counselling (SAC).",
      "Carol has worked with a diverse student population presenting with a wide range of concerns, including depression, anxiety, academic stress, identity issues, grief, and relational challenges. She provides both individual and couple counselling, and has a particular interest in supporting individuals who have experienced trauma, including sexual trauma and developmental trauma.",
      "Her therapeutic approach is integrative and trauma-informed, drawing from a range of evidence-based modalities such as Eye Movement Desensitization and Reprocessing, Somatic Experiencing, person-centred therapy, and cognitive behavioural methods. She is also trained in the Gottman Method for Couple Counselling, and is currently working towards certification in Attachment-Focused EMDR.",
      "In addition to her clinical work, Carol has several years of experience providing clinical consultation. She has completed the Essentials of Clinical Supervision training and is currently pursuing the Postgraduate Certificate in Clinical and Casework Supervision to further support the professional development of fellow counsellors.",
      "Carol considers it a privilege to listen deeply and walk alongside individuals on their journey of growth. She values collaboration, presence, and attunement in the therapeutic process and is committed to creating a safe, compassionate, and non-judgmental space where individuals can explore their challenges, access their strengths, and move toward healing at a pace that feels right for them."
    ]
  },
  {
    "name": "Chua Hui Xian Valerie",
    "email": "valchua@nus.edu.sg",
    "title": "Senior Counselling Psychologist",
    "specialisation": "Counselling Psychologist",
    "photoUrl": "/images/VALERIE.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Valerie is a Counselling Psychologist with a decade of experience across diverse settings, including community services, educational institutions, and forensic setting. She has supported individuals facing a broad spectrum of psychological challenges such as depression, anxiety, psychosis, trauma, stress and burnout, interpersonal difficulties, and adjustment-related concerns.",
      "She is currently part of the University Counselling Services team at NUS, where she provides both individual and group-based psychological support to students. Valerie integrates a range of therapeutic modalities in her practice, including Cognitive Behavioural Therapy, Schema Therapy, and Mindfulness-based Interventions, tailoring her approach to meet the unique needs of each client.",
      "Valerie is a member of the Singapore Psychological Society and is in the process of obtaining registration with the Singapore Register of Psychologists. She is also undergoing training in clinical supervision as part of her professional development.",
      "Valerie’s beliefs about supervision are grounded in the importance of thoughtful reflection and the cultivation of self-awareness. She views supervision as a collaborative and supportive space that not only enhances clinical skills and ethical decision-making but also fosters personal and professional growth."
    ]
  },
  {
    "name": "Shatish Jayakumar Rajamanickam",
    "email": "shatishj@nus.edu.sg",
    "title": "Senior Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/SH.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Shatish is a counsellor with close to a decade of experience across both local and international settings. For the past five years, he has been a member of the University Counselling Services team at the National University of Singapore (NUS), where he provides psychological support to students.",
      "He has worked with individuals facing a wide range of psychological concerns, including anxiety, depression, interpersonal, adjustment, stress, and burnout. Shatish draws from a variety of therapeutic modalities in his clinical practice, including Cognitive Behavioural Therapy (CBT), Schema Therapy, Internal Family Systems Therapy (IFS), and a range of Mindfulness-based interventions, which he tailors to suit each client’s unique needs.",
      "He is a member of the Singapore Association for Counselling and is in the process of completing his registration. As part of his ongoing professional development, he will also be undergoing training in clinical supervision. Shatish views supervision as a safe, supportive environment that goes beyond enhancing clinical skills by also encouraging personal and professional growth."
    ]
  },
  {
    "name": "Mandy Lee",
    "email": "mandy.lee@nus.edu.sg",
    "title": "Principal Counsellor",
    "specialisation": "Counselling",
    "photoUrl": "/images/MANDY.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Mandy is a practicing counsellor with over a decade of experience in the mental health field. Her career has afforded her the opportunity to work with diverse populations across various settings, including hospitalization programs and private practice.",
      "Before transitioning into counselling, Mandy began her professional journey in corporate communications, where she developed strong skills in active listening and relationship-building; strengths that continue to inform her work as a mental health professional today.",
      "Mandy believes that life often brings complex challenges, and her role as a therapist is to support individuals in navigating these difficulties and developing effective, positive coping strategies. Her therapeutic approach is grounded in evidence-based modalities, including Cognitive Behaviour Therapy (CBT), Schema Therapy, and Internal Family Systems (IFS). Recently, she has also incorporated Emotional Freedom Technique (EFT) - a form of tapping on specific meridian points while focusing on negative emotions as a complementary tool for the populations she serves.",
      "Mandy is a registered supervisor with the Singapore Association for Counselling (SAC). She believes that the supervisory relationship should be built on a foundation of trust, non-judgment, and acceptance. Mandy is committed to supporting the clinical development of her supervisees while emphasizing the importance of cultivating self-awareness and a grounded therapeutic presence. Above all, she strives to create a safe, supportive environment where supervisees can grow both personally and professionally."
    ]
  },
  {
    "name": "Tan Siew Kei Joanna Ashley",
    "email": "joanna.ashley.tan@nus.edu.sg",
    "title": "Clinical Governance Lead (Senior Principal Clinical Psychologist)",
    "specialisation": "Clinical Psychologist",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "photoUrl": "/images/JAT.jpg",
    "bio": [
      "Joanna is a Clinical Psychologist with over a decade of experience across public, private, and educational mental health settings. Her training spans the United States, Australia, and Singapore, and she has worked with individuals across the lifespan—from young children to older adults—presenting with a broad spectrum of psychological and psychiatric concerns.",
      "Her clinical career has included working with both inpatient and outpatient populations in general psychiatry, as well as with children and adolescents experiencing mood and anxiety difficulties. Most recently, Joanna served at Yale-NUS College supporting young adults navigating complex developmental, relational, and emotional challenges.",
      "Alongside clinical work, Joanna has been providing clinical supervision for the past ten years. She has supervised trainees from a variety of postgraduate Clinical Psychology and Counselling programs.",
      "Joanna is trained in a range of therapeutic modalities—including Cognitive Behavioural Therapy (CBT), Emotion-Focused Therapy (EFT), and Schema Therapy—but her core orientation, both as a therapist and supervisor, is grounded in psychodynamic psychotherapy.",
      "Her supervisory style is relational, reflective, and insight-focused. She offers a psychologically safe and attuned space for supervisees to explore the emotional dimensions of their clinical work, navigate transference and countertransference, and reflect on their own professional identity development. Through a psychodynamic lens, Joanna supports supervisees in deepening their understanding of client dynamics, while encouraging growth in their own self-awareness and therapeutic presence."
    ]
  },
  {
    "name": "Ahl Claudia Stephanie",
    "email": "claudia.ahl@nus.edu.sg",
    "title": "Principal Wellbeing Specialist Partner",
    "specialisation": "Clinical Psychologist",
    "photoUrl": "/images/Claudia.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Claudia completed her Master’s in Clinical Psychology in Australia in 2013 and has since worked across a range of settings, including KK Women’s & Children’s Hospital, Yale-NUS College, and private clinical practices. She has been providing clinical supervision regularly since 2018.",
      "Claudia’s clinical work encompasses a broad spectrum of presenting issues, including anxiety, depression, stress, interpersonal and relational challenges, personality disorders, eating and body image concerns, and difficulties with emotional regulation. She primarily draws from Cognitive Behavioural Therapy (CBT), Schema Therapy, Dialectical Behaviour Therapy (DBT), and Mindfulness-based approaches in her practice.",
      "As a supervisor, Claudia takes a collaborative and supportive approach, aiming to create a safe and nurturing space where supervisees feel comfortable discussing their challenges openly. She strives to offer guidance and constructive feedback while maintaining a level of challenge that promotes professional growth and development."
    ]
  },
  {
    "name": "Soon Jiaying",
    "email": "jy_soon@nus.edu.sg",
    "title": "Senior Wellbeing Specialist Partner",
    "specialisation": "Clinical Psychologist",
    "photoUrl": "/images/SJY.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Jiaying is a Clinical Psychologist with experience across various settings, including special education, community services, primary care, and private healthcare. She has worked with individuals facing a wide range of psychological concerns such as stress, depression, anxiety, adjustment difficulties, relationship challenges, parenting issues, and experiences of grief and loss.",
      "Currently, Jiaying is part of HWB’s Staff Wellbeing and Engagement team, where she provides individual psychotherapeutic support to NUS staff. She draws from a range of evidence-based therapeutic approaches, including Cognitive Behavioural Therapy (CBT), Acceptance and Commitment Therapy (ACT), Solution-Focused Therapy (SFT), and Mindfulness-based interventions.",
      "Jiaying is an SRP-approved Supervisor and has been offering clinical supervision for the past three years. Her training includes a Certificate of Attainment in Supervision, as well as formal knowledge in Reflective Practice and Deliberate Practice in Supervision.",
      "Jiaying’s supervision is grounded in relationship-building and thoughtful reflection. She values collaboration and is committed to supporting her supervisees in deepening their understanding of client dynamics, while fostering growth in self-awareness and therapeutic presence."
    ]
  },
  {
    "name": "John Leow",
    "email": "john.lhc@nus.edu.sg",
    "title": "Senior Care Manager",
    "specialisation": "Case Management",
    "photoUrl": "/images/JL.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "John is a Senior Care Manager with the Staff Wellbeing and Engagement (SWEE) Team, where he supports the Respondent Care and Mental Health Return-to-Work programmes. He brings over a decade of experience in the community service sector and private practice, working with a broad spectrum of individuals across different life stages and challenges.",
      "John holds a Master of Social Science in Professional Counselling from the Executive Counselling and Training Academy (ECTA) and has been a SAC Registered Counsellor since 2017. He has a strong interest in supporting individuals experiencing addiction and mental health challenges, and currently focuses on helping individuals reintegrate and thrive in the workplace following mental health recovery.",
      "Grounded in an integrative therapeutic framework, John draws from evidence-based modalities such as Acceptance and Commitment Therapy (ACT), Cognitive Behavioural Therapy (CBT), and Schema Therapy, among others. His approach is client-centred and adaptable to the unique needs of each individual.",
      "Since 2017, John has been actively involved in supervising Master’s-level counselling interns from institutions such as ECTA, James Cook University (JCU), Monash University, and the Singapore University of Social Sciences (SUSS). In addition, he has been mentoring practising counsellors since 2021, supporting their professional development and clinical growth. His supervisory practice is supported by formal training, including a Certificate of Attainment in Supervision. He adopts a collaborative, reflective, and skills-focused approach to nurture confident, ethical, and client-centred practitioners."
    ]
  },
  {
    "name": "Dominic Yeo Kian Tong",
    "email": "dominicy@nus.edu.sg",
    "title": "Senior Care Manager",
    "specialisation": "Social Work",
    "photoUrl": "/images/DY.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Dominic holds a Bachelor's degree in Social Work and has had the privilege of working in both social service agencies and the Ministry of Health in the past. Due to these roles, his training and experience range from case management and counselling to mental health policy and administration. Dominic enjoys working with individuals and families navigating safety and risk concerns, and he leans on psychodynamic, person-centred and CBT approaches to guide his practice.",
      "Dominic has also been supervising students and social workers for 4 years; a role he finds deeply rewarding and meaningful. His supervisory style is warm and nurturing, always centred on the supervisee’s learning needs and growth. Past supervisees have described the supervision space as safe, validating, and reflective, where honest, constructive feedback supported their growth in skill and confidence."
    ]
  },
  {
    "name": "Kirsty Png",
    "email": "kirstyp@nus.edu.sg",
    "title": "Senior Wellbeing Specialist Partner",
    "specialisation": "Counselling Psychologist",
    "photoUrl": "/images/KIRSTY.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Kirsty is a Senior Wellbeing Specialist Partner with HWB. As an SRP approved supervisor, her clinical experience spans across a range of presenting concerns including trauma, grief and loss, mood & anxiety disorders, learning needs, parenting challenges, and relationship challenges.",
      "With professional training in Counselling Psychology, Educational Therapy, and Gottman Couples Therapy level 3, Kirsty has worked in the educational, community, public hospital & private health care settings. Kirsty adopts an integrative approach which encompasses Psychodynamic, SBT, DBT, SFBT, MI, Gottman Couples Therapy, and TFCBT modalities.",
      "Supervisory style wise, Kirsty holds space for reflective and collaborative practices, placing much value in scaffolding supervisee’s growth as a person as well as in professional capacities."
    ]
  },
  {
    "name": "Jaya Rajesh",
    "email": "jaya@nus.edu.sg",
    "title": "Senior Residential Wellness Manager",
    "specialisation": "Social Work",
    "photoUrl": "/images/jaya.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "Jaya is a dedicated Residential Wellness Manager with over 11 years of experience in providing clinical supervision. She holds master’s degrees in Social Work, Narrative Therapy, and Community Work, and is a registered SASW supervisor. Jaya has supervised social work interns since 2014 and junior staff from 2016 to 2022, offering both group and individual supervision. Her expertise lies in utilizing social work principles, case management, and narrative therapy to support and empower those under her care. Since 2024, Jaya has also been offering clinical supervision within HWB, guiding practitioners in their professional development and ensuring high standards of clinical practice. She is passionate about helping individuals re-author their stories, guiding them through personal challenges with empathy and a strengths-based approach.",
      "In her current role, Jaya focuses on addressing the emotional and psychological concerns of residential students, offering timely guidance and support to ensure their well-being. She is also actively involved in the development of student leaders, conducting training sessions, and organizing various engagement activities to foster a connected and supportive residential community. Through her holistic and compassionate approach, Jaya creates a nurturing environment that enables students to thrive both personally and academically."
    ]
  },
  {
    "name": "Jimmy Sim Chin Min",
    "email": "jim_sim@nus.edu.sg",
    "title": "Lead Residential Wellness Manager",
    "specialisation": "Counselling",
    "photoUrl": "/images/jimmy.jpg",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "bio": [
      "As the Residential Wellness Manager (Lead), Jim works closely with the Chief Wellbeing Officer (Andrew) and Deputy Head (Zheng) to ensure effective case management and the provision of timely support for students residing in NUS hostels. His collaborative approach and commitment to student welfare help foster a safe and supportive environment, empowering students to navigate challenges and thrive during their university journey.",
      "Jim holds a Certificate in Supervision for the Social Services (Basic) and brings a strong background in Counselling, having dedicated his professional career to the education sector since graduation. Beginning with peer case consultations in 2023, Jim has been offering clinical supervision within HWB since 2024, supporting fellow practitioners in their growth and reflective practice. While he does not adhere to any specific therapeutic modality, Jim is particularly drawn to strength-based and person-centered approaches, believing in the inherent potential and resilience of each individual.",
      "Jim is likely to be known for his participative supervisory style, with previous supervisees highlighting how his openness and flexibility have positively benefited their own practices. He encourages active dialogue and mutual learning, creating an environment where supervisees feel heard, supported, and empowered to develop their clinical skills and confidence."
    ]
  },
  {
    "name": "Goh Zhengqin",
    "email": "gzq@nus.edu.sg",
    "title": "Deputy Director & Deputy Head",
    "specialisation": "Clinical Psychologist",
    "badges": [
      {
        "src": "/images/SGF.jpg",
        "alt": "SPS Singapore"
      },
      {
        "src": "/images/ELEPHANT.jpg",
        "alt": "Elephant Badge"
      },
      {
        "src": "/images/PENGUIN.jpg",
        "alt": "Penguin Badge"
      },
      {
        "src": "/images/MONKEY.jpg",
        "alt": "Monkey Badge"
      }
    ],
    "photoUrl": "/images/gzq.jpg"
  }
]
